**NAMA : IMA RISTIANI**

**NIM : 2000015027**

**PRODI : MATEMATIKA**

# Pandas DataFrame

Pandas adalah Library analisis data yang memiliki struktur data yang diperlukan untuk membersihkan data mentah ke dalam sebuah bentuk yang cocok untuk analisis (yaitu tabel). Pandas melakukan tugas penting seperti menyelaraskan data untuk perbandingan dan penggabungan set data, penanganan data yang hilang, dll

## Import Modul

In [1]:
import pandas as pd

## Membuat DataFrame
**Membuat Matriks Menggunakan List**

In [2]:
# List
list_buah = ['Jeruk', 'Pepaya', 'Mangga', 'Rambutan', 'Leci', 'Nanas', 'Manggis']
  
# Membuat DataFrame menggunakan list_buah
df = pd.DataFrame(list_buah)
df

          0
0     Jeruk
1    Pepaya
2    Mangga
3  Rambutan
4      Leci
5     Nanas
6   Manggis

**Membuat Data Frame Menggunakan List dan Fungsi Zip**

In [3]:
# List Buah (string)
list_buah = ['Jeruk', 'Pepaya', 'Mangga', 'Rambutan', 'Leci', 'Nanas', 'Manggis']
  
# List Berat Buah (Integer)
list_berat = [50, 800, 150, 10, 2, 300, 70]
  
# Membuat dataframe menggunakan Dua Buah List dengan Fungsi Zip
df = pd.DataFrame(list(zip(list_buah, list_berat)),
               columns =['Nama Buah', 'Berat Buah'])
df

  Nama Buah  Berat Buah
0     Jeruk          50
1    Pepaya         800
2    Mangga         150
3  Rambutan          10
4      Leci           2
5     Nanas         300
6   Manggis          70

**Membuat DataFrame Menggunakan List Multidimensi**

In [4]:
# List Multidimensi (Nama, Usia) 
lst = [['Bejo', 25], ['Ari', 30],
       ['Asep', 26], ['Richard', 22]]
    
df = pd.DataFrame(lst, columns =['Nama', 'Usia'])
df

      Nama  Usia
0     Bejo    25
1      Ari    30
2     Asep    26
3  Richard    22

**Membuat Dataframe Menggunakan Dictionary**

Cara yang paling mudah dipahami untuk membuat dataframe adalah menggunakan input dictionary. Yang mana key akan menjadi nama kolom dan valuenya akan menjadi data dalam kolom tersebut(biasanya berupa list). Strukturnya adalah sebagai berikut:
```
data = {'Nama Kolom 1': ['Data Baris 1', 'Data Baris 2', ...],
        'Nama Kolom 2': ['Data Baris 1', 'Data Baris 2', ...],
         ...
        }
df = pd.DataFrame (data)
```

In [5]:
mobil = {'Type Mobil': ['Honda Civic','Toyota Corolla','Ford Focus','Audi A4'],
        'Harga(USD)': [22000,25000,27000,35000]
        }

df = pd.DataFrame(mobil)

df

       Type Mobil  Harga(USD)
0     Honda Civic       22000
1  Toyota Corolla       25000
2      Ford Focus       27000
3         Audi A4       35000

## Mengimport DataFrame

Kamu dapat mengimpor dataframe dari file berupa tabel lainnya seperti .xls, .xlsx, .csv, .txt, dan .json.

### Import DataFrame dari File CSV

In [20]:
df_super_store = pd.read_csv('/content/Super-Store-Dataset_convert.csv')
df_super_store.head()

   Unnamed: 0        order_id  order_date  ...       sales quantity     profit
0           0  CA-2016-152156  11/08/2016  ...      261.96        2   419136.0
1           1  CA-2016-152156  11/08/2016  ...      731.94        3   219582.0
2           2  CA-2016-138688  06/12/2016  ...       14.62        2  2488915.0
3           3  US-2015-108966  10/11/2015  ...  9575775.00        5  -383031.0
4           4  US-2015-108966  10/11/2015  ...    22368.00        2  1192184.0

[5 rows x 10 columns]

### Import DataFrame dari File Excel

In [22]:
df_pilkada=pd.read_excel('/content/datasetpilkadadki.xlsx')
df_pilkada.head()

   Id  ...                                         Text Tweet
0   1  ...  Banyak akun kloning seolah2 pendukung #agussil...
1   2  ...  #agussilvy bicara apa kasihan yaa...lap itu ai...
2   3  ...  Kalau aku sih gak nunggu hasil akhir QC tp lag...
3   4  ...  Kasian oh kasian dengan peluru 1milyar untuk t...
4   5  ...  Maaf ya pendukung #AgusSilvy..hayo dukung #Ani...

[5 rows x 4 columns]

## DataFrame & Series
Di Pandas terdapat 2 kelas data baru yang digunakan sebagai struktur dari spreadsheet:

1. **Series**
2. **DataFrame**

In [8]:
# Series
number_series = pd.Series([1,2,3,4,5,5])
print("Series:")
number_series

Series:

0    1
1    2
2    3
3    4
4    5
5    5
dtype: int64

In [10]:
# DataFrame
matrix = [[1,2,3],
          ['a','b','c'],
          [3,4,5],
          ['d',4,6]]

matrix_df = pd.DataFrame(matrix)

matrix_df

   0  1  2
0  1  2  3
1  a  b  c
2  3  4  5
3  d  4  6

### Atribut DataFrame & Series
Dataframe dan Series memiliki sangat banyak atribut yang digunakan untuk transformasi data, tetapi ada beberapa attribute yang sering dipakai.

In [23]:
df_super_store

      Unnamed: 0        order_id  order_date  ...       sales quantity      profit
0              0  CA-2016-152156  11/08/2016  ...      261.96        2   419136.00
1              1  CA-2016-152156  11/08/2016  ...      731.94        3   219582.00
2              2  CA-2016-138688  06/12/2016  ...       14.62        2  2488915.00
3              3  US-2015-108966  10/11/2015  ...  9575775.00        5  -383031.00
4              4  US-2015-108966  10/11/2015  ...    22368.00        2  1192184.00
...          ...             ...         ...  ...         ...      ...         ...
9983        9983  CA-2014-110422   1/21/2014  ...    25248.00        3  -318399.00
9984        9984  CA-2017-121258   2/26/2017  ...       91.96        2   156332.00
9985        9985  CA-2017-121258   2/26/2017  ...   258576.00        2   193932.00
9986        9986  CA-2017-121258   2/26/2017  ...    44376.00        4       13.32
9987        9987  CA-2017-119914  05/04/2017  ...      243.16        2    72948.00

[9988 rows x 10 columns]

**1. Atrribute .head()**

Atrribute .head() untuk melihat 5(default dan bisa dirubah) data teratas pada dataframe.

In [24]:
df_super_store.head()

   Unnamed: 0        order_id  order_date  ...       sales quantity     profit
0           0  CA-2016-152156  11/08/2016  ...      261.96        2   419136.0
1           1  CA-2016-152156  11/08/2016  ...      731.94        3   219582.0
2           2  CA-2016-138688  06/12/2016  ...       14.62        2  2488915.0
3           3  US-2015-108966  10/11/2015  ...  9575775.00        5  -383031.0
4           4  US-2015-108966  10/11/2015  ...    22368.00        2  1192184.0

[5 rows x 10 columns]

**2. Attribute .tail()**

Attribute .tail() untuk melihat 5(default dan bisa dirubah) data teratas pada dataframe.

In [25]:
df_super_store.tail()

      Unnamed: 0        order_id  order_date  ...      sales quantity     profit
9983        9983  CA-2014-110422   1/21/2014  ...   25248.00        3 -318399.00
9984        9984  CA-2017-121258   2/26/2017  ...      91.96        2  156332.00
9985        9985  CA-2017-121258   2/26/2017  ...  258576.00        2  193932.00
9986        9986  CA-2017-121258   2/26/2017  ...   44376.00        4      13.32
9987        9987  CA-2017-119914  05/04/2017  ...     243.16        2   72948.00

[5 rows x 10 columns]

**3. Attribute .info()**

Attribute .info() digunakan untuk mengecek kolom apa yang membentuk dataframe itu, data types, berapa yang non null, dll. Attribute ini tidak dapat digunakan pada series, hanya pada data frame saja

In [26]:
df_super_store.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9988 entries, 0 to 9987
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    9988 non-null   int64
 1   order_id      9988 non-null   object
 2   order_date    9988 non-null   object
 3   customer_id   9988 non-null   object
 4   segment       9988 non-null   object
 5   category      9988 non-null   object
 6   sub_category  9988 non-null   object
 7   sales         9988 non-null   float64
 8   quantity      9988 non-null   int64
 9   profit        9988 non-null   float64
dtypes: float64(2), int64(2), object(6)
memory usage: 780.4+ KB

**4. Attribute .shape**

Attribute .shape digunakan untuk mengetahui berapa baris dan kolom, hasilnya dalam format tuple (baris, kolom).

In [27]:
df_super_store.shape

(9988, 10)

**5. Attribute .dtypes**

Attribute .dtypes digunakan untuk mengetahui tipe data di tiap kolom. Tipe data object: kombinasi untuk berbagai tipe data (number & text, etc).

In [28]:
df_super_store.dtypes

Unnamed: 0        int64
order_id         object
order_date       object
customer_id      object
segment          object
category         object
sub_category     object
sales           float64
quantity          int64
profit          float64
dtype: object

**6. Attribute .astype(nama_tipe_data)**

Attribute .astype(nama_tipe_data) untuk convert tipe data berdasarkan tipe data seperti: **float, int, str, numpy.float, numpy.int** ataupun **numpy.datetime**.

In [29]:
df_str = df_super_store.astype("str")
df_str.head()

  Unnamed: 0        order_id  order_date  ...      sales quantity     profit
0          0  CA-2016-152156  11/08/2016  ...     261.96        2   419136.0
1          1  CA-2016-152156  11/08/2016  ...     731.94        3   219582.0
2          2  CA-2016-138688  06/12/2016  ...      14.62        2  2488915.0
3          3  US-2015-108966  10/11/2015  ...  9575775.0        5  -383031.0
4          4  US-2015-108966  10/11/2015  ...    22368.0        2  1192184.0

[5 rows x 10 columns]

In [ ]:
df_str.dtypes

**7. Attribute .copy()**

Attribute .copy() digunakan melakukan duplikat, untuk disimpan di variable yang berbeda mungkin supaya tidak loading data lagi.

In [30]:
df_SS=df_super_store.copy()
df_SS

      Unnamed: 0        order_id  order_date  ...       sales quantity      profit
0              0  CA-2016-152156  11/08/2016  ...      261.96        2   419136.00
1              1  CA-2016-152156  11/08/2016  ...      731.94        3   219582.00
2              2  CA-2016-138688  06/12/2016  ...       14.62        2  2488915.00
3              3  US-2015-108966  10/11/2015  ...  9575775.00        5  -383031.00
4              4  US-2015-108966  10/11/2015  ...    22368.00        2  1192184.00
...          ...             ...         ...  ...         ...      ...         ...
9983        9983  CA-2014-110422   1/21/2014  ...    25248.00        3  -318399.00
9984        9984  CA-2017-121258   2/26/2017  ...       91.96        2   156332.00
9985        9985  CA-2017-121258   2/26/2017  ...   258576.00        2   193932.00
9986        9986  CA-2017-121258   2/26/2017  ...    44376.00        4       13.32
9987        9987  CA-2017-119914  05/04/2017  ...      243.16        2    72948.00

[9988 rows x 10 columns]

**8. Attribute .to_list()**

Attribute .to_list() digunakan untuk mengubah series menjadi list dan tidak dapat digunakan untuk dataframe.

In [31]:
print(number_series.to_list())

[1, 2, 3, 4, 5, 5]

**9. Attribute .unique()**

Attribute .unique() digunakan menghasilkan nilai unik dari suatu kolom, hasilnya dalam bentuk numpy array. Attribute ini hanya digunakan pada series saja.

In [32]:
print(number_series.unique())

[1 2 3 4 5]

**10. Attribute .index**

Attribute .index digunakan untuk mencari index/key dari Series atau Dataframe.

In [33]:
df_super_store.index

RangeIndex(start=0, stop=9988, step=1)

**11. Attribute .columns**

Attribute .columns digunakan untuk mengetahui apa saja kolom yang tersedia di dataframe tersebut (hanya digunakan untuk dataframe saja).

In [34]:
df_super_store.columns

Index(['Unnamed: 0', 'order_id', 'order_date', 'customer_id', 'segment',
       'category', 'sub_category', 'sales', 'quantity', 'profit'],
      dtype='object')

**12. Attribute .counts()**

Attribute .count() untuk menghitung jumlah data pada masing-masing kolom.

In [35]:
df_super_store.count()

Unnamed: 0      9988
order_id        9988
order_date      9988
customer_id     9988
segment         9988
category        9988
sub_category    9988
sales           9988
quantity        9988
profit          9988
dtype: int64

**13. Attribute .value_counts**

Attribute .value_counts digunakan untuk mengetahui jumlah data kategori unik pada setiap kolom

In [36]:
df_pilkada.head()

   Id  ...                                         Text Tweet
0   1  ...  Banyak akun kloning seolah2 pendukung #agussil...
1   2  ...  #agussilvy bicara apa kasihan yaa...lap itu ai...
2   3  ...  Kalau aku sih gak nunggu hasil akhir QC tp lag...
3   4  ...  Kasian oh kasian dengan peluru 1milyar untuk t...
4   5  ...  Maaf ya pendukung #AgusSilvy..hayo dukung #Ani...

[5 rows x 4 columns]

In [37]:
df_pilkada.Sentiment.value_counts()

positive    450
negative    450
Name: Sentiment, dtype: int64

**14. Attribute .describe()**

Attribute .describe() digunakan untuk menampilkan ringkasan statistik data numerik pada sebuah dataframe

In [38]:
df_super_store.describe()

        Unnamed: 0         sales     quantity        profit
count  9988.000000  9.988000e+03  9988.000000  9.988000e+03
mean   4993.500000  1.013168e+05     3.789147  4.442494e+05
std    2883.431578  5.049215e+05     2.225586  1.582453e+06
min       0.000000 -3.286850e+05     1.000000 -3.839990e+07
25%    2496.750000  5.184000e+01     2.000000  8.640000e+00
50%    4993.500000  5.776100e+02     3.000000  7.177200e+04
75%    7490.250000  4.426200e+04     5.000000  6.241920e+05
max    9987.000000  2.396266e+07    14.000000  4.630476e+07